using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lambda
{
    class Program
    {
        static void Main(string[] args)
        {
            //•В Main создать список из нескольких людей
            //•При помощи лямбда - функций:
            //•А) получить список уникальных имен
            //•Б) вывести список уникальных имен в формате: Имена: Иван, Сергей, Петр.
            //•В) получить список людей младше 18, посчитать для них средний возраст
            //•Г) при помощи группировки получить Map, в котором ключи – имена, а значения – средний возраст
            //•Д) получить людей, возраст которых от 20 до 45, вывести в консоль их имена в порядке убывания возраста



        }
    }
}
